quanvu20702/Tetris_Game_STM32F401/Src/main.c
 /* File name: STM32_Project_Game_Tetris
 *
 * Description: Xây d?ng game tetris trên LCD
 *
 *
 * Last Changed By:  $Author: $ VTQUAN & BMNGOC
 * Revision:         $Revision: $
 * Last Changed:     $Date: $December 28, 2023
 *
 * Code sample:
 ******************************************************************************/
/******************************************************************************/
/*                              INCLUDE FILES                                 */
/******************************************************************************/
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <misc.h>
#include <timer.h>
#include <system_stm32f4xx.h>
#include <lightsensor.h>
#include <Ucglib.h>
#include <stm32f401re_gpio.h>
#include <stm32f401re_rcc.h>
#include "stm32f401re_syscfg.h"
#include "stm32f401re_exti.h"
#include <utilities.h>


/******************************************************************************/
/*                     PRIVATE TYPES and DEFINITIONS                         */
/******************************************************************************/
// Define GPIO_PIN*************************************************************/
// Button B2
#define BUTTON_LEFT_B2_PORT			GPIOB
#define BUTTON_LEFT_B2_PIN			GPIO_Pin_3

// Button B4
#define BUTTON_RIGHT_B4_PORT		GPIOB
#define BUTTON_RIGHT_B4_PIN			GPIO_Pin_0

// Button B1
#define BUTTON_UP_B1_PORT			GPIOB
#define BUTTON_UP_B1_PIN			GPIO_Pin_5

// Button B3
#define BUTTON_PLAY_B3_PORT			GPIOA
#define BUTTON_PLAY_B3_PIN			GPIO_Pin_4

// Define Screen Parameters************************************************/
#define SCREEN_WIDTH 12
#define SCREEN_HEIGHT 24


/* Private variables*******************************************************/
ucg_t ucg;
static int x_axis = 10;
static uint32_t idTimer = NO_TIMER;
uint32_t idTimerStopGame = NO_TIMER;
uint32_t timeRepeat = 500;
uint8_t eCurrentState;
static int size = 5;
static int currentX = 10;
static int currentY = -9;
int checkRow = 0;
int checkColumn = 0;
int deleteRow = 0;
static int screen[SCREEN_HEIGHT][SCREEN_WIDTH];
static char str1[10] = "";
static int currentRotation = 1;
int currentBlock[4][4];
int nextBlock[4][4];
int blockIndex;
int (*block)[4] = currentBlock;
static int score = 0;
static int maxx;
static int minx;

/* Function prototypes*****************************************************/

static void initializeApplication(void);
void loadConfiguration(void);
void initScreen(void);
void initializeCurrentBlock(void);
void chooseBlock(void);
void drawBlockOnScreen(int x, int y,  int block[4][4]);
void eraseBlockOnScreen(int x, int y, int block[4][4]);
int checkForCollisions (int x, int y, int block[4][4]);
void fixBlockOnScreen(int x, int y, int block[4][4]);
void handleFallingBlock(int block[4][4]);
void startFallingBlockTimer(int block[4][4]);
void handleFullRows(void);
void checkForGameOver(void);
void updateScore(void);
int calculateBlockMaxWidth(int block[4][4], int x0);
int calculateBlockWidth(int block[4][4]);
void rotateCurrentBlock(void);

static void initB1ButtonInterrupt(void);
static void initB2ButtonInterrupt(void);
static void initB3ButtonInterrupt(void);
static void initB4ButtonInterrupt(void);

/* Definitions for various block types */
static int block_T1[4][4] =
{
	{0,1,0,0},
	{1,1,1,0},
	{0,0,0,0},
	{0,0,0,0}
};
static int block_T2[4][4] =
{
	{0,1,0,0},
	{1,1,0,0},
	{0,1,0,0},
	{0,0,0,0}
};
static int block_T3[4][4] =
{
	{0,0,0,0},
	{1,1,1,0},
	{0,1,0,0},
	{0,0,0,0}
};
static int block_T4[4][4] =
{
	{0,1,0,0},
	{0,1,1,0},
	{0,1,0,0},
	{0,0,0,0}
};

static int block_J1[4][4] =
{
	{0,1,0,0},
	{0,1,0,0},
	{1,1,0,0},
	{0,0,0,0}
};
static int block_J2[4][4] =
{
	{0,0,0,0},
	{1,1,1,0},
	{0,0,1,0},
	{0,0,0,0}
};
static int block_J3[4][4] =
{
	{0,1,1,0},
	{0,1,0,0},
	{0,1,0,0},
	{0,0,0,0}
};
static int block_J4[4][4] =
{
	{1,0,0,0},
	{1,1,1,0},
	{0,0,0,0},
	{0,0,0,0}
};
static int block_L1[4][4] =
{
	{0,1,0,0},
	{0,1,0,0},
	{0,1,1,0},
	{0,0,0,0}
};
static int block_L2[4][4] =
{
	{0,0,1,0},
	{1,1,1,0},
	{0,0,0,0},
	{0,0,0,0}
};
static int block_L3[4][4] =
{
	{1,1,0,0},
	{0,1,0,0},
	{0,1,0,0},
	{0,0,0,0}
};
static int block_L4[4][4] =
{
	{0,0,0,0},
	{1,1,1,0},
	{1,0,0,0},
	{0,0,0,0}
};
static int block_Z1[4][4] =
{
	{0,0,0,0},
	{0,1,1,0},
	{0,0,1,1},
	{0,0,0,0}
};
static int block_Z2[4][4] =
{
	{0,0,1,0},
	{0,1,1,0},
	{0,1,0,0},
	{0,0,0,0}
};
static int block_Z3[4][4] =
{
	{0,0,0,0},
	{0,0,1,1},
	{0,1,1,0},
	{0,0,0,0}
};
static int block_Z4[4][4] =
{
	{0,1,0,0},
	{0,1,1,0},
	{0,0,1,0},
	{0,0,0,0}
};
static int block_I1[4][4] =
{
	{0,1,0,0},
	{0,1,0,0},
	{0,1,0,0},
	{0,1,0,0}
};
static int block_I2[4][4] =
{
	{0,0,0,0},
	{1,1,1,1},
	{0,0,0,0},
	{0,0,0,0}
};

static int block_O[4][4] =
{
	{0,0,0,0},
	{0,1,1,0},
	{0,1,1,0},
	{0,0,0,0}
};

/******************************************************************************/
/*                            PRIVATE FUNCTIONS                               */
/******************************************************************************/
/**
 * @func   initB1ButtonInterrupt
 * @brief  Initialize Interrupt for Button B1
 * @param  None
 * @retval None
 */
static void initB1ButtonInterrupt(void){
	GPIO_InitTypeDef	GPIO_InitStructure;
	EXTI_InitTypeDef	EXTI_InitStructure;
	NVIC_InitTypeDef	NVIC_InitStructure;

	// Enable Clock Port B;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_Pin = BUTTON_UP_B1_PIN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	GPIO_Init(GPIOB, &GPIO_InitStructure);

	//  Enable Clock Syscfg, Connect EXTI Line 5 to PB5 pin
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource5);

	//	Configuration Interrupt
	EXTI_InitStructure.EXTI_Line =  EXTI_Line5;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_Init(&EXTI_InitStructure);

	// Configuration NVIC
	NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStructure);
}

/**
 * @func   initB2ButtonInterrupt
 * @brief  Initialize Interrupt for Button B2
 * @param  None
 * @retval None
 */
static void initB2ButtonInterrupt(void) {
    // Enable Clock Port B
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

    // Configure GPIO for Button B2
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_Pin = BUTTON_LEFT_B2_PIN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // Enable Clock for Syscfg, Connect EXTI Line 3 to PB3 pin
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource3);

    // Configure EXTI for Button B2
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line = EXTI_Line3;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_Init(&EXTI_InitStructure);

    // Configure NVIC for Button B2
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStructure);
}

/**
 * @func   initB3ButtonInterrupt
 * @brief  Initialize Interrupt for Button B3
 * @param  None
 * @retval None
 */
static void initB3ButtonInterrupt(void) {
    // Enable Clock Port A
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

    // Configure GPIO for Button B3
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_Pin = BUTTON_PLAY_B3_PIN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

