quanvu20702/Tetris_Game_STM32F401/Src/main.c
    // Enable Clock for Syscfg, Connect EXTI Line 4 to PA4 pin
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource4);

    // Configure EXTI for Button B3
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line = EXTI_Line4;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_Init(&EXTI_InitStructure);

    // Configure NVIC for Button B3
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStructure);
}

/**
 * @func   initB4ButtonInterrupt
 * @brief  Initialize Interrupt for Button B4
 * @param  None
 * @retval None
 */
static void initB4ButtonInterrupt(void) {
    // Enable Clock Port B
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

    // Configure GPIO for Button B4
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_Pin = BUTTON_RIGHT_B4_PIN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // Enable Clock for Syscfg, Connect EXTI Line 0 to PB0 pin
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource0);

    // Configure EXTI for Button B4
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line = EXTI_Line0;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_Init(&EXTI_InitStructure);

    // Configure NVIC for Button B4
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&NVIC_InitStructure);
}

/**
 * @func   delayMs
 * @brief  Delay for a specified number of milliseconds.
 * @param  milliseconds: The duration of the delay in milliseconds
 * @retval None
 */
void delayMs(uint32_t milliseconds) {
    // Calculate the number of cycles needed for the delay
    uint32_t cycles = (50000000 / 1000) * milliseconds;

    // Simple loop-based delay
    for (uint32_t i = 0; i < cycles; i++) {
        // Do nothing
    }
}

/**
 * @func   loadConfiguration
 * @brief  Initializes the configuration for the Tetris game.
 * @param  None
 * @retval None
 */
void loadConfiguration(void) {
	ucg_DrawFrame(&ucg, 0, 0, 62, 122);					// Draw a frame for the game area
	ucg_DrawString(&ucg, 65, 15, 0, "Teris Game");		// Display the Tetris Game title
	ucg_DrawString(&ucg, 65, 50, 0, "Score: ");			// Display the initial score
}

/**
 * @func   initScreen
 * @brief  Initializes the screen array
 * @param  None
 * @retval None
 */
void initScreen(void) {
	for (int i = -4; i < SCREEN_HEIGHT; i++) {
	        for (int j = 0; j < SCREEN_WIDTH; j++) {
	            screen[i][j] = 0;
	        }
	    }
}
// Init 19 blocks of game
int (*blockTypes[])[4] = {  block_T1, block_T2, block_T3, block_T4,
							block_J1, block_J2, block_J3, block_J4,
							block_Z1, block_Z2, block_Z3, block_Z4,
							block_L1, block_L2, block_L3, block_L4,
							block_I1, block_I2, block_O};
int (*block_T[])[4] = {block_T1, block_T2, block_T3, block_T4};
int (*block_J[])[4] = {block_J1, block_J2, block_J3, block_J4};
int (*block_Z[])[4] = {block_Z1, block_Z2, block_Z3, block_Z4};
int (*block_L[])[4] = {block_L1, block_L2, block_L3, block_L4};
int (*block_I[])[4] = {block_I1, block_I2};


/**
 * @func   chooseBlock
 * @brief  Random Block Selection
 * @param  None
 * @retval None
 */
void chooseBlock(void) {
    // Generate a random index for the block type
    int randomBlockIndex = LightSensor_MeasureUseDMAMode() % 19;
    // Point to the selected random block type
    int (*randomBlock)[4] = blockTypes[randomBlockIndex];
    blockIndex = randomBlockIndex;
	// Copy the selected block to the nextBlock array
    memcpy(nextBlock, randomBlock, sizeof(nextBlock));
}

/**
 * @func   initializeCurrentBlock
 * @brief  Initializes the current block by choosing a new block.
 * @param  None
 * @retval None
 */
void initializeCurrentBlock(void) {
	chooseBlock();
	// Copy values from nextBlock to currentBlock
    memcpy(currentBlock, nextBlock, sizeof(currentBlock));
}

/**
 * @func   drawBlockOnDisplay
 * @brief  Draw a block on the graphics screen
  * @param  x: X-coordinate of the block's top-left corner
 *         	y: Y-coordinate of the block's top-left corner
 *         	block: 2D array representing the block to be drawn
 * @retval None
 */
void drawBlockOnScreen(int x, int y,  int block[4][4]) {
	ucg_SetColor(&ucg, 0, 0, 255, 255);
    // Iterate through the block and draw filled boxes on the screen where the block is present
	for(int i = 0; i < 4; i++){
		for(int j = 0; j < 4; j++) {
			if(block[i][j] == 1) {
				int px = x + j*size+1;
				int py = y + i*size;
				ucg_DrawBox(&ucg, px, py, size, size);
			}
		}
	}
}

/**
 * @func   eraseBlockOnScreen
 * @brief  Erase a block on the graphics screen
 * @param  x: X-coordinate of the block's top-left corner
 *         y: Y-coordinate of the block's top-left corner
 *         block: 2D array representing the block to be erased
 * @retval None
 */
void eraseBlockOnScreen(int x, int y, int block[4][4]) {
	ucg_SetColor(&ucg, 0, 0, 0, 0);
    // Iterate through the block and draw filled boxes with the background color to erase the block
	for(int i = 0; i < 4; i++){
		for(int j = 0; j < 4; j++) {
			if(block[i][j] == 1) {
				int px = x + j*size+1;
				int py = y + i*size;
				ucg_DrawBox(&ucg, px, py, size, size);
			}
		}
	}
}


/**
 * @func   checkForCollisions
 * @brief  Check for collisions between a block and the screen boundaries or other elements on the screen.
 * @param  x: X-coordinate of the block's top-left corner
 *         y: Y-coordinate of the block's top-left corner
 *         block: 2D array representing the block
 * @retval 1 if there is a collision, 0 otherwise
 */
int checkForCollisions(int x, int y, int block[4][4]) {
	for(int i = 0; i < 4; i++) {
		for(int j = 0; j < 4; j++) {
			if(block[i][j] == 1){
				int px = x + j*size;
				int py = y + i*size;
				// Check for collision with screen boundaries
                if (py >= SCREEN_HEIGHT * size) return 1;

                // Check for collision with existing elements on the screen
                if (screen[py / 5][px / 5] == 1) return 1;
			}
		}
	}
	return 0; // No collision
}

/**
 * @func   fixBlockOnScreen
 * @brief  Fix a block onto the game screen.
 * @param  x: X-coordinate of the block's top-left corner
 *         y: Y-coordinate of the block's top-left corner
 *         block: 2D array representing the block
 * @retval None
 */
void fixBlockOnScreen(int x, int y, int block[4][4]) {
    // Iterate through the block and update the screen array to fix the block
	for(int i = 0; i < 4; i++) {
		for(int j = 0; j < 4; j++) {
			if(block[i][j] == 1){
				int px = x + j*size;
				int py = y + i*size;
				screen[py/5][px/5] = 1;
			}
		}
	}
}

/**
 * @func   updateScore
 * @brief  Update the displayed score on the graphical screen.
 * @param  None
 * @retval None
 */
void updateScore(){
	ucg_SetColor(&ucg, 0, 255, 0, 0);
	memset(str1,0,sizeof(str1));
	sprintf(str1,"Score: %d",score);
	ucg_DrawString(&ucg, 65, 48, 0, str1);
}

/**
 * @func   handleFullRows
 * @brief  Handle full rows in the game screen by updating the score and adjusting the screen.
 * @param  None
 * @retval None
 */
void handleFullRows(){
	ucg_SetColor(&ucg, 0, 0, 0, 0);
    // Iterate through the screen to find full rows and update the score
	for(int i = 0; i < SCREEN_HEIGHT; i++){
		for(int j = 0; j < SCREEN_WIDTH; j++){
			if(screen[i][j] == 1){
				checkRow++;

