quanvu20702/Tetris_Game_STM32F401/Src/main.c
				if(checkRow == SCREEN_WIDTH){
					if (timeRepeat > 0){
						timeRepeat -= 20;
					}
					// Update score
					score+=5;
					// Erase the full row
					ucg_SetColor(&ucg, 0, 0, 0, 0);
					ucg_DrawBox(&ucg,1,i*5+1,SCREEN_WIDTH*5,5);
					// Clear the full row in the screen array
					for(int k = 0; k<SCREEN_WIDTH; k++){
						screen[i][k] = 0;
					}

					// Shift blocks above the cleared row down
					ucg_SetColor(&ucg, 0, 0, 0, 0);
					for(int ii = 4; ii <= i; ii++){
						for(int jj = 0; jj < SCREEN_WIDTH; jj++) {
							if(screen[ii][jj] == 1) {
								int px =  jj*size+1;
								int py =  ii*size+1;
								ucg_DrawBox(&ucg, px, py, size, size);
							}
						}
					}

					// Update the screen array by shifting blocks down
					for(int new_height = i; new_height >= 5; new_height--){
						for(int new_width = SCREEN_WIDTH - 1; new_width >= 0; new_width--){
							screen[new_height][new_width] = screen[new_height - 1][new_width];
						}
					}

					// Redraw the shifted blocks
					ucg_SetColor(&ucg,0,0,255,255);
					for(int ii = 4; ii <= i; ii++){
						for(int jj = 0; jj < SCREEN_WIDTH; jj++) {
							if(screen[ii][jj] == 1) {
								int px =  jj*size+1;
								int py =  ii*size+1;
								ucg_DrawBox(&ucg, px, py, size, size);
							}
						}
					}

					checkRow = 0;
				}
			}
			else{
				checkRow = 0;
				break;
			}
		}
	}
}

/**
 * @func   checkForGameOver
 * @brief  Check if the first row of the game screen has any block; if true, handle "Game Over".
 * @param  None
 * @retval None
 */
void checkForGameOver(){
	for(int i = 0 ; i < SCREEN_WIDTH;i++){
		if(screen[0][i] == 1){
			ucg_SetColor(&ucg, 0, 255, 0, 0);
			ucg_DrawString(&ucg, 4 ,60, 0, "Game Over");
			TimerStop(idTimer);
		}
	}
}


/**
 * @func   handleFallingBlock
 * @brief  Handle the falling and placement of a block in the game, including collision detection and game state updates.
 * @param  block: 2D array representing the falling block
 * @retval None
 */
void handleFallingBlock(int block[4][4]){
	drawBlockOnScreen(currentX, currentY, block);
	delayMs(100);
	handleFullRows();
	// Check for collisions with the block below
	if(!checkForCollisions(currentX, currentY + size, block)) {
		// If no collision, erase the block and move it down
		eraseBlockOnScreen(currentX, currentY, block);
		currentY += size;
	}
	else {
		// If collision, fix the block on the screen, reset position, choose a new block
		fixBlockOnScreen(currentX, currentY, block);
		currentX = 25;
		currentY = -9;
		x_axis = currentX;
		chooseBlock();
	    for (int i = 0; i < 4; i++) {
	        for (int j = 0; j < 4; j++) {
	            currentBlock[i][j] = nextBlock[i][j];
	        }
	    }
		// Check for game over
		checkForGameOver();
	}
	// Update the minx and maxx values based on block width and position
	minx = (calculateBlockMaxWidth(block, x_axis) - calculateBlockWidth(block))*size;
	maxx = calculateBlockMaxWidth(block, x_axis)*size;
	// Update the currentX position if it changed
	if(x_axis != currentX) {
		currentX = x_axis;
	}
	 // Update the score display
	updateScore();
}

/**
 * @func   startFallingBlockTimer
 * @brief  Start a timer to handle the falling of a block at a specified interval.
 * @param  block: 2D array representing the falling block
 * @retval None
 */
void startFallingBlockTimer(int block[4][4]) {
	// Stop the timer if it's already running
	if (idTimer != NO_TIMER) {
		TimerStop(idTimer);
	}
	// Start a timer to handle the falling block at a specified interval
	idTimer = TimerStart("Fall", timeRepeat, TIMER_REPEAT_FOREVER, (void*) handleFallingBlock, block);
}

/**
 * @func   calculateBlockMaxWidth
 * @brief  Calculate the maximum width of a block based on its 2D array representation.
 * @param  block: 2D array representing the block
 * @param  x0: X-coordinate of the leftmost column of the block
 * @retval Maximum width of the block
 */
int calculateBlockMaxWidth(int block[4][4], int x0) {
    int max_width = -1;
    // Iterate through the block and calculate the maximum width
    for (int i = 0; i < 4; i++) {
        for (int j = 0; j < 4; j++) {
            if (block[i][j] == 1) {
                int cellX = x0 + j;
                if (cellX > max_width) {
                    max_width = cellX;
                }
            }
        }
    }
    return max_width - abs(x0) + 1;
}

/**
 * @func   calculateBlockWidth
 * @brief  Calculate the width of a block.
 * @param  block: 2D array representing the block
 * @retval Width of the block
 */
int calculateBlockWidth(int block[4][4]) {
    int width = 0;
    // Iterate through the block and calculate the width of each row
    for (int i = 0; i < 4; i++) {
        int rowWidth = 0;
        for (int j = 0; j < 4; j++) {
            if (block[i][j] == 1) {
                rowWidth++;
            }
        }
        // Update the width if the current row's width is greater
        if (rowWidth > width) {
            width = rowWidth;
        }
    }

    return width;
}

/**
 * @func   rotateCurrentBlock
 * @brief  Rotate the current block based on its type and handle collisions.
 * @param  None
 * @retval None
 */
void rotateCurrentBlock(void) {
    // Erase the current block before rotation
	eraseBlockOnScreen(currentX, currentY, block);
    // Calculate the next rotation index
	int nextRotation = (currentRotation + 1)%4;
	int tempBlock[4][4];
	// Determine block type and perform rotation
	if (blockIndex >= 0 && blockIndex < 4) {
        // Rotate the block type T
		blockIndex = (blockIndex + currentRotation)%4;
	    int (*rotBlock)[4] = block_T[blockIndex];
	    if (!checkForCollisions(currentX, currentY, rotBlock)) {
		    for (int i = 0; i < 4; i++) {
			        for (int j = 0; j < 4; j++) {
			            tempBlock[i][j] = rotBlock[i][j];
			        }
			    }
	    }
	    for (int i = 0; i < 4; i++) {
		        for (int j = 0; j < 4; j++) {
		            currentBlock[i][j] = tempBlock[i][j];
		        }
		    }
	    currentRotation = nextRotation;
	}
	// Determine block type and perform rotation
	if (blockIndex >= 4 && blockIndex < 8) {
        // Rotate the block type J
		blockIndex = (blockIndex - 4 + currentRotation)%4;
	    int (*rotBlock)[4] = block_J[blockIndex];
	    if (!checkForCollisions(currentX, currentY, rotBlock)) {
		    for (int i = 0; i < 4; i++) {
			        for (int j = 0; j < 4; j++) {
			            tempBlock[i][j] = rotBlock[i][j];
			        }
			    }
	    }
	    for (int i = 0; i < 4; i++) {
		        for (int j = 0; j < 4; j++) {
		            currentBlock[i][j] = tempBlock[i][j];
		        }
		    }
	    currentRotation = nextRotation;
	    blockIndex += 4;
	}
	// Determine block type and perform rotation
	if (blockIndex >= 8 && blockIndex < 12) {
        // Rotate the block type Z
		blockIndex = (blockIndex - 8 + currentRotation)%4;
	    int (*rotBlock)[4] = block_Z[blockIndex];
	    if (!checkForCollisions(currentX, currentY, rotBlock)) {
		    for (int i = 0; i < 4; i++) {
			        for (int j = 0; j < 4; j++) {
			            tempBlock[i][j] = rotBlock[i][j];
			        }
			    }
	    }
	    for (int i = 0; i < 4; i++) {
		        for (int j = 0; j < 4; j++) {
		            currentBlock[i][j] = tempBlock[i][j];
		        }
		    }
	    currentRotation = nextRotation;
	    blockIndex += 8;
	}
	// Determine block type and perform rotation
	if (blockIndex >= 12 && blockIndex < 16) {
        // Rotate the block type L
		blockIndex = (blockIndex - 12 + currentRotation)%4;
	    int (*rotBlock)[4] = block_L[blockIndex];
	    if (!checkForCollisions(currentX, currentY, rotBlock)) {
		    for (int i = 0; i < 4; i++) {
			        for (int j = 0; j < 4; j++) {
			            tempBlock[i][j] = rotBlock[i][j];
			        }
			    }
	    }
	    for (int i = 0; i < 4; i++) {
		        for (int j = 0; j < 4; j++) {
		            currentBlock[i][j] = tempBlock[i][j];
		        }
		    }
	    currentRotation = nextRotation;
	    blockIndex += 12;
	}
	// Determine block type and perform rotation
	if (blockIndex >= 16 && blockIndex < 18) {
        // Rotate the block type I
		blockIndex = (blockIndex - 16 + currentRotation)%2;
		int (*rotBlock)[4] = block_I[blockIndex];
		if (!checkForCollisions(currentX, currentY, rotBlock)) {
			for (int i = 0; i < 4; i++) {
			        for (int j = 0; j < 4; j++) {
			            tempBlock[i][j] = rotBlock[i][j];
			        }
			    }
		}
		for (int i = 0; i < 4; i++) {
		        for (int j = 0; j < 4; j++) {
		            currentBlock[i][j] = tempBlock[i][j];
		        }
		    }
		currentRotation = nextRotation;
		blockIndex += 16;
		}
}

/**
 * @func   EXTI3_IRQHandler
 * @brief  Interrupt Service Routine for handling Button B2 to move left.
 * @param  None
 * @retval None
 */
void EXTI3_IRQHandler(void)//Button B2 for go left
{
	// Check if moving left is within the boundary
	if(EXTI_GetFlagStatus(EXTI_Line3) == SET)
	{
		if (x_axis + minx >= size) {
			x_axis -= size;
		}
	}
	// Clear the EXTI line 3 pending bit
	EXTI_ClearITPendingBit(EXTI_Line3);
}

/**
 * @func   EXTI0_IRQHandler
 * @brief  Interrupt Service Routine for handling Button B4 to move right.
 * @param  None
 * @retval None
 */
void EXTI0_IRQHandler(void) {
    if (EXTI_GetFlagStatus(EXTI_Line0) == SET) {
        // Check if moving right is within the boundary
        if (x_axis + maxx <= (SCREEN_WIDTH - 1) * size) {
            x_axis += size;
        }
    }
    // Clear the EXTI line 0 pending bit
    EXTI_ClearITPendingBit(EXTI_Line0);
}

/**
 * @func   EXTI4_IRQHandler
 * @brief  Interrupt Service Routine for handling Button B3 to start the game.
 * @param  None
 * @retval None
 */
void EXTI4_IRQHandler(void) {
    if (EXTI_GetFlagStatus(EXTI_Line4) == SET) {
        // Start the falling block timer when Button B3 is pressed
        startFallingBlockTimer(block);
    }
    // Clear the EXTI line 4 pending bit
    EXTI_ClearITPendingBit(EXTI_Line4);
}

/**
 * @func   EXTI5_IRQHandler
 * @brief  Interrupt Service Routine for handling Button B1 to rotate the current block.
 * @param  None
 * @retval None
 */
void EXTI9_5_IRQHandler(void) {
    if (EXTI_GetFlagStatus(EXTI_Line5) == SET) {
        // Rotate the current block when Button B1 is pressed
    	rotateCurrentBlock();
    }
    // Clear the EXTI line 5 pending bit
    EXTI_ClearITPendingBit(EXTI_Line5);
}

/**
 * @func   initializeApplication
 * @brief  Common initialization routine for the application.
 * @param  None
 * @retval None
 */
static void initializeApplication(void){
	// Update the system core clock
    SystemCoreClockUpdate();

    // Initialize timers
    TimerInit();

    // Initialize the current block
    initializeCurrentBlock();

    // Initialize the light sensor in DMA mode
    LightSensor_Init(ADC_READ_MODE_DMA);

    // Initialize interrupts for buttons B1, B2, B3, and B4
    initB1ButtonInterrupt();
    initB2ButtonInterrupt();
    initB4ButtonInterrupt();
    initB3ButtonInterrupt();

    // Begin the initialization of the LCD using the Ucglib4WireSWSPI library
    Ucglib4WireSWSPI_begin(&ucg, UCG_FONT_MODE_SOLID);

    // Clear the screen
    ucg_ClearScreen(&ucg);

    // Set the font and color for the LCD
    ucg_SetFont(&ucg, ucg_font_ncenR08_hr);
    ucg_SetColor(&ucg, 0, 255, 255, 255);
    ucg_SetColor(&ucg, 1, 0, 0, 0);

    // Rotate the display 180 degrees
    ucg_SetRotate180(&ucg);
}

int main(void) {
    // Initialize the application
    initializeApplication();

    // Load configuration settings
    loadConfiguration();

    // Main application loop
    while (1) {
        // Process the timer scheduler
        processTimerScheduler();
    }

    // The program should never reach this point
    return 0;
}
/**********************************************************************************/
